{
  "title": "Ken's Labyrinth",
  "author": "Nightfox",
  "category": "game",
  "version": "3.2.2",
  "url": "https://github.com/sacredbanana/lab3d-sdl",
  "license": "n/a",
  "description": "Enhanced version of the MS-DOS classic 3D shooter Ken's Labyrinth.",
  "details": "LAB3D/SDL\\n\\nLAB3D/SDL is a port of Ken's Labyrinth to modern operating systems, using\\nOpenGL for graphics output and the SDL library to provide user input, sound\\noutput, threading, and some graphics support functions. Music output is\\nthrough Adlib emulation or MIDI (MIDI only on Windows, Linux and other\\noperating systems with OSS-compatible sound APIs).\\n\\nThis code has been tested on Windows 98, Windows ME, Windows XP,\\nSuSE Linux 7.2 and 8.1, Debian Linux 2.2, SunOS 5.8 (Solaris 8),\\nFreeBSD 4.7 and Nintendo Switch.\\n\\nImprovements over the original Ken's Labyrinth:\\n\\n- Runs natively on 32-bit/64-bit Windows, Unix or Nintendo Switch.\\n- Supports big-endian CPUs.\\n- Uses OpenGL to provide hardware accelerated, anti-aliased graphics with\\n  trilinear interpolation in true colour (where available).\\n- Hi-res texture support.\\n- Multiple simultaneous sound effects.\\n- Improved General MIDI music.\\n- Adlib emulation.\\n- Game controller support.\\n- Many bug fixes.",
  "changelog": "3.2.2\\n* USB keyboard and mouse support for Nintendo Switch\\nma3.2.1\\n* Anisotropic filtering now supported on Switch\\n\\n3.2.0\\n* New audio device selectable in the setup menu: Adlib random instruments. This will play\\n  the music tracks with randomly selected instruments. If you don't like the instrument settings\\n  you can select it again and it will load a different random set.\\n* Changing audio settings now no longer requires you to quit the game. All changes are immediate\\n* Switch - Now dynamically switches to 1080p from 720p when connecting to the dock and vice versa. \\n           The setup menu will also reflect the current mode.\\n\\n3.1.2\\n * Upgraded the Adlib emulator to Ken's 64 bit compatible one resolving all music issues\\n   such as silent or distorted instruments on some platforms\\n\\n3.1.1\\n  NOTE: If updating from 3.0.0 you will need to delete Ken2.nro because the new\\n  executable has a different name.\\n\\n  * Switch - Renamed executable so that it appears properly in the homebrew menu in SX OS\\n  * Switch - Swapped select and cancel buttons for menus\\n  * Switch - Use Switch account name if user is signed in, \"Ken\" otherwise\\n  * Switch - Improved use of depth buffer\\n  * Switch - Quitting game from main menu now quits gracefully\\n\\n3.1\\n  * Created a port for Nintendo Switch\\n"
}